# 570. Managers with at Least 5 Direct Reports
[問題](https://leetcode.com/problems/managers-with-at-least-5-direct-reports/description/?envType=study-plan-v2&envId=30-days-of-pandas&lang=pythondata)

## 解答の方針
manager_idでグルーピングして、カウントする。
5個以上のmanager_idに対して、employee tableを結合する。  
nullは返さないので、結合の際には`inner`を指定する。

In [37]:
import pandas as pd

In [48]:
def find_managers(employee: pd.DataFrame) -> pd.DataFrame:
    grouped = employee.groupby("managerId")["id"].size().reset_index(name="count")
    result = grouped[grouped["count"] >= 5].merge(employee, left_on="managerId", right_on="id", how="inner")
    return result[["name"]]

In [39]:
data = [[101, 'John', 'A', None], [102, 'Dan', 'A', 101], [103, 'James', 'A', 101], [104, 'Amy', 'A', 101], [105, 'Anne', 'A', 101], [106, 'Ron', 'B', 101]]
employee = pd.DataFrame(data, columns=['id', 'name', 'department', 'managerId']).astype({'id':'Int64', 'name':'object', 'department':'object', 'managerId':'Int64'})

In [40]:
employee

    id   name department  managerId
0  101   John          A       <NA>
1  102    Dan          A        101
2  103  James          A        101
3  104    Amy          A        101
4  105   Anne          A        101
5  106    Ron          B        101

In [41]:
find_managers(employee)

   name
0  John

## Test scripts

In [42]:
grouped = employee.groupby("managerId")["id"].size().reset_index(name="count")

In [43]:
grouped

   managerId  count
0        101      5

In [46]:
result = grouped[grouped["count"] >= 5].merge(employee, left_on="managerId", right_on="id", how="inner")

In [47]:
result[["name"]]

   name
0  John